app/controllers/newbooks_controller.rb

SELECT "newbooks".* FROM "newbooks"
---
  def index
    @newbooks = Newbook.all

SELECT  "newbooks".* FROM "newbooks" WHERE "newbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @newbook = Newbook.find(params[:id])

SELECT  "newbooks".* FROM "newbooks" WHERE "newbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @newbook = Newbook.find(params[:id])

INSERT INTO "newbooks" ("Title", "Body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Title", "test"], ["Body", "test"], ["created_at", "2018-10-11 06:15:40.818790"], ["updated_at", "2018-10-11 06:15:40.818790"]]
---
  def create
    @newbook = Newbook.new(newbook_params)

    respond_to do |format|
      if @newbook.save

UPDATE "newbooks" SET "Title" = ?, "Body" = ?, "updated_at" = ? WHERE "newbooks"."id" = ?  [["Title", "リーダブルコード"], ["Body", "より良いコードを書くためのシンプルで実践的なテクニック"], ["updated_at", "2018-10-10 07:39:47.175939"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @newbook.update(newbook_params)

DELETE FROM "newbooks" WHERE "newbooks"."id" = ?  [["id", 9]]
---
  def destroy
    @newbook.destroy

SELECT  "newbooks".* FROM "newbooks" WHERE "newbooks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_newbook
      @newbook = Newbook.find(params[:id])